# Development Domain Brewfile

# Version Management
brew "mise"

# Git Ecosystem
brew "git"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "ghq"
brew "lazygit"

# Cloud/DevOps
brew "docker"
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "terraform"
brew "awscli"

# Tools
brew "jq"
brew "yq"
brew "yaak" # API Testing

# AI Coding
cask "cursor"
# claude is usually a cask or npm, assuming cask for desktop
cask "claude"
