4ops.terraform
aaron-bond.better-comments
abusaidm.html-snippets
ahmadalli.vscode-nginx-conf
ahmadawais.emoji-log-vscode
anysphere.pyright
bierner.markdown-mermaid
biomejs.biome
bradgashler.htmltagwrap
bradlc.vscode-tailwindcss
bung87.vscode-gemfile
burkeholland.simple-react-snippets
catppuccin.catppuccin-vsc
cesium.gltf-vscode
christian-kohler.path-intellisense
coenraads.bracket-pair-colorizer-2
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
denoland.vscode-deno
donjayamanne.githistory
dsznajder.es7-react-js-snippets
dzhavat.bracket-pair-toggler
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
formulahendry.auto-rename-tag
fwcd.kotlin
github.copilot
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.geminicodeassist
googlecloudtools.cloudcode
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hbenl.vscode-test-explorer
hediet.vscode-drawio
ibm.output-colorizer
jebbs.plantuml
jeroen-meijer.pubspec-assist
jnoortheen.nix-ide
johnpapa.vscode-peacock
jumail.headwind
knisterpeter.vscode-github
leetcode.vscode-leetcode
leodevbro.blockman
lkrms.inifmt
luanpotter.dart-import
markosth09.color-picker
mechatroner.rainbow-csv
metaphore.kanagawa-vscode-color-theme
mikestead.dotenv
mosapride.zenkaku
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-playwright.playwright
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
naumovs.color-highlight
necinc.elmmet
oderwat.indent-rainbow
pashkatrick.grpc-client
pkief.material-icon-theme
plex.vscode-protolint
pmneo.tsimporter
pranaygp.vscode-css-peek
prisma.prisma
pulkitgangwar.nextjs-snippets
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
serayuzgur.crates
simonsiefke.svg-preview
skyran.js-jsx-snippets
sswg.swift-lang
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
syler.sass-indented
taichi.vscode-textlint
tamasfe.even-better-toml
tht13.python
timonwong.shellcheck
toba.vsfire
tombonnike.vscode-status-bar-format-toggle
tomoki1207.pdf
tonybaloney.vscode-pets
unifiedjs.vscode-mdx
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudiotoolsforunity.vstuc
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wangtao0101.debug-leetcode
wix.vscode-import-cost
xabikos.javascriptsnippets
xshrim.txt-syntax
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zxh404.vscode-proto3
