# Productivity Domain Brewfile

# Knowledge
cask "notion"
cask "obsidian"

# Communication
cask "slack"
cask "discord"
cask "zoom"

# System
cask "raycast"
cask "1password"
cask "karabiner-elements"
cask "aerospace"
cask "hammerspoon"

# Utilities
cask "dropover"
cask "paste"
# nebo might be iPad app, checking if mac app exists or mas
# aquavoice might be cask

# System Domain Brewfile

# Core
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"

# Mac Tools
brew "mas"
brew "trash"
cask "displaylink"
cask "marta"

# UI Customization
brew "sketchybar"
brew "borders"
cask "klack"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-sf-mono"
