tap "argon/mas"
tap "argoproj/tap"
tap "ethereum/ethereum"
tap "fastly/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "rcmdnk/file"
tap "rcmdnk/rcmdnkpac"
brew "aom"
brew "apr"
brew "apr-util"
brew "argocd"
brew "argon2"
brew "autoconf"
brew "coreutils"
brew "asdf"
brew "aspell"
brew "python@3.9"
brew "awscli"
brew "brotli"
brew "c-ares"
brew "glib"
brew "tcl-tk"
brew "cairo"
brew "cfitsio"
brew "ruby"
brew "cocoapods"
brew "colordiff"
brew "composer"
brew "ctags"
brew "libssh2"
brew "openldap"
brew "curl"
brew "deno"
brew "emojify"
brew "ethereum"
brew "exa"
brew "fasd"
brew "fish"
brew "flow-cli"
brew "gh"
brew "ghq"
brew "git"
brew "helm"
brew "hub"
brew "hugo"
brew "jq"
brew "libpq"
brew "luajit", args: ["HEAD"]
brew "mysql@5.7"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "nghttp2"
brew "nodebrew"
brew "peco"
brew "php-code-sniffer"
brew "php-cs-fixer"
brew "pipenv"
brew "protobuf"
brew "pyenv-virtualenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "sk"
brew "sl"
brew "starship"
brew "tmux"
brew "tree"
brew "trunk"
brew "zellij"
brew "zsh"
brew "zsh-completions"
brew "argon/mas/mas"
brew "fastly/tap/fastly"
brew "qmk/qmk/qmk"
brew "rcmdnk/file/brew-file"
brew "rcmdnk/rcmdnkpac/rcmdnk-trash"
cask "qmk-toolbox"
cask "utm"
cask "vagrant"
cask "virtualbox"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
