aaron-bond.better-comments
ahmadawais.emoji-log-vscode
astro-build.astro-vscode
biomejs.biome
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hediet.vscode-drawio
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-playwright.playwright
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
pkief.material-icon-theme
prisma.prisma
redhat.vscode-yaml
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
wix.vscode-import-cost
yoavbls.pretty-ts-errors 