# Taps
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "github/gh"
tap "oven-sh/bun"    # For bun installation
tap "nikitabobko/tap"    # For aerospace installation
tap "FelixKratz/formulae"    # For borders and sketchybar installation

# Core utilities
brew "coreutils"      # GNU core utilities
brew "moreutils"      # Additional Unix utilities
brew "findutils"      # GNU find, locate, updatedb and xargs
brew "gnu-sed"        # GNU sed
brew "grep"           # GNU grep
brew "less"           # Terminal pager
brew "wget"           # File retrieval utility
brew "curl"           # HTTP client
brew "openssh"        # OpenSSH client
brew "reattach-to-user-namespace"  # Utility for tmux
brew "gmp"            # GNU Multiple Precision Arithmetic Library

# Shell and terminal
brew "zsh"            # Modern shell
brew "zsh-completions"  # Additional completions for zsh
brew "tmux"           # Terminal multiplexer
brew "starship"       # Cross-shell prompt
brew "zellij"         # Modern terminal multiplexer

# CLI tools
brew "sk"             # Fuzzy finder (Rust alternative to peco)
brew "fzf"            # Fuzzy finder
brew "ghq"            # Remote repository management
brew "eza"            # Modern replacement for ls
brew "fd"             # Simple, fast alternative to find
brew "bat"            # Cat clone with syntax highlighting
brew "ripgrep"        # Fast search tool
brew "zoxide"         # Smarter cd command
brew "jq"             # JSON processor
brew "tree"           # Directory listing as tree
brew "colordiff"      # Colorized diff
brew "htop"           # Process viewer
brew "git-delta"      # Syntax-highlighting pager for git
brew "ical-buddy"     # Calendar command line tool
brew "loop"           # UNIX's missing loop command
brew "superfile"      # CLI file manager
brew "trash"          # CLI utility to move files to the trash

# Development tools
brew "git"            # Version control
brew "git-lfs"        # Git Large File Storage
brew "gh"             # GitHub CLI
brew "neovim"         # Modern vim
brew "tig"            # Text-mode interface for git
brew "lazygit"        # Simple terminal UI for git commands
brew "helix"          # Modern text editor
brew "ctags"          # Source code tagging
brew "gnupg"          # GPG suite for signing
brew "lua"            # Lua programming language
brew "switchaudio-osx" # Audio device switcher
brew "nowplaying-cli" # Now Playing CLI

# Languages and package managers

# Container and cloud tools
brew "docker"         # Container platform
brew "kubernetes-cli" # Kubernetes CLI
brew "k9s"            # Kubernetes TUI
brew "argocd"         # GitOps tool
brew "awscli"         # AWS CLI

# Database tools
brew "mysql"          # MySQL database
brew "redis"          # Redis database

# Build tools and dependencies
brew "cmake"          # Build system
brew "autoconf"       # Automatic configure script builder
brew "sccache"        # Compiler cache
brew "protobuf"       # Protocol buffers
brew "protoc-gen-go"  # Go protobuf generator
brew "protoc-gen-go-grpc" # Go gRPC generator

# Image and document processing
brew "imagemagick"    # Image manipulation
brew "ffmpeg"         # Multimedia framework
brew "plantuml"       # Diagram tool

# Font tools
tap "homebrew/cask-fonts"  # フォント用のtapを明示的に追加
cask "font-jetbrains-mono-nerd-font"  # brewではなくcaskとして指定
cask "font-hack-nerd-font"            # brewではなくcaskとして指定
cask "font-hackgen"           # 白源フォント
cask "font-hackgen-nerd"      # 白源フォント（Nerd Fonts版）
cask "sf-symbols"             # SF Symbols
cask "font-sf-mono"           # SF Mono
cask "font-sf-pro"            # SF Pro

# Casks
cask "font-jetbrains-mono"
cask "ngrok"          # Tunnel tool

# Development Tools
cask "visual-studio-code"
cask "cursor"
cask "wezterm"        # Modern GPU-accelerated terminal
cask "docker"
cask "postman"
cask "android-studio"
cask "orbstack"
cask "devtoys"
cask "unity-hub"      # Unity開発環境
cask "epic-games"     # Unreal Engine用

# AI/ML Tools
cask "ollama"    # Local AI models

# Browsers
cask "arc"
cask "google-chrome"
cask "firefox"
cask "brave-browser"  # Privacy-focused browser

# Communication & Productivity
cask "slack"
cask "discord"
cask "notion"
cask "obsidian"
cask "raycast"
cask "1password"
cask "alt-tab"
cask "magnet"
cask "aerospace"         # Tiling window manager (alternative to Magnet)
cask "onedrive"
cask "line"          # コミュニケーション
cask "paste"         # クリップボード管理
cask "nebo"          # ノートアプリ

# Design Tools
cask "figma"
cask "blender"       # 3Dモデリング
cask "davinci-resolve" # 動画編集

# Media
cask "vlc"
cask "obs"
cask "spotify"

# System Tools
cask "karabiner-elements"
cask "utm"
brew "borders"        # Window borders for macOS
brew "sketchybar"     # Customizable menu bar replacement
cask "displaylink"    # 外部ディスプレイ管理
cask "cloudflare-warp"    # Fast & secure VPN with 1.1.1.1 DNS
cask "marta"          # Native macOS file manager with Lua customization

# Optional
cask "zoom"

# Remove outdated versions